
## Plan Result (management/single_sign_on)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937203258)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;072693953877&#34;]
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;107662415716&#34;]
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;373303485727&#34;]
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;577523824419&#34;]
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;612023513349&#34;]
  * module.sso.aws_ssoadmin_account_assignment.admin[&#34;941697148827&#34;]
  * module.sso.aws_ssoadmin_permission_set.main[&#34;AdministratorAccess&#34;]
  * module.sso.aws_ssoadmin_permission_set.main[&#34;ReadOnlyAccess&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sso.aws_ssoadmin_account_assignment.admin["072693953877"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "072693953877"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_account_assignment.admin["107662415716"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "107662415716"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_account_assignment.admin["373303485727"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "373303485727"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_account_assignment.admin["577523824419"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "577523824419"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_account_assignment.admin["612023513349"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "612023513349"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_account_assignment.admin["941697148827"] will be created
  + resource "aws_ssoadmin_account_assignment" "admin" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + permission_set_arn = (known after apply)
      + principal_id       = "c7a4bad8-0041-7093-195f-e335b46327c6"
      + principal_type     = "GROUP"
      + target_id          = "941697148827"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.sso.aws_ssoadmin_permission_set.main["AdministratorAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "main" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Managed by Terraform"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + name             = "AdministratorAccess"
      + session_duration = "PT12H"
      + tags_all         = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/single_sign_on"
        }
    }

  # module.sso.aws_ssoadmin_permission_set.main["ReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "main" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Managed by Terraform"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-7758bc66b9181d7c"
      + name             = "ReadOnlyAccess"
      + session_duration = "PT12H"
      + tags_all         = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/single_sign_on"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":144,"Program":"tfcmt","SHA1":"c79708182080c6b5acc6c16a87dbb633fb7c4672","Target":"management/single_sign_on","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->